tutorials/myLusgsFoam/GAMM/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0.6172680979278903;

boundaryField
{
    emptyPlanes
    {
        type            empty;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
0.6172680979278903
0.6172680979278903
0.6172680979278903
0.6172680979278903
0.6172680979278903
0.6172680979278903
0.6172680979278903
0.6172680979278903
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0.6172680979278903;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.6171074137919054;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.6172680979278904;
    }
}


// ************************************************************************* //
